<?php

use Illuminate\Database\Seeder;
use Illuminate\Database\Eloquent\Model;

class AboutSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $data = [
            [
                'text_ua' => 'Найбільші та комфортні танцювальні зали у місті',
                'text_ru' => 'Самые большие и комфортные танцевальные залы в городе'
            ],
            [
                'text_ua' => 'Найпотужніша тренерська команда професіоналів - фанатів своєї справи',
                'text_ru' => 'Мощнейшая тренерская команда профессионалов - фанатов своего дела'
            ],
            [
                'text_ua' => 'Магазин та ательє спеціалізованого танцювального одягу',
                'text_ru' => 'Магазин и ателье специализированной танцевальной одежды'
            ],
            [
                'text_ua' => 'Індивідуальний підхід до розвитку Вас або Вашої дитини',
                'text_ru' => 'Индивидуальный подход к развитию Вас или Вашего ребенка'
            ],
            [
                'text_ua' => 'Фреш-бар, кафе',
                'text_ru' => 'Фреш-бар, кафе'
            ]
        ];
        DB::table('abouts')->insert($data);
    }
}
