<?php

use Illuminate\Database\Seeder;
use Illuminate\Database\Eloquent\Model;

class DanceDirectionSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $data = [
            [
                'path_image' => 'images/direction/ballroom.jpg',
                'title_ua' => 'Спортивний танець',
                'title_ru' => 'Спортивный танец',
                'text_short_ua' => '',
                'text_short_ru' => '',
                'text_ua' => 'Спортивний танець - це одне з найвдаліших поєднань спорту та мистецтва у сучасному світі. Яскраві та емоційні дії спортсменів насичені духом змагань і турнірів. Світ спортивних бальних танців сьогодні надзвичайно широкий та багатогранний, він набуває популярності в усіх країнах світу. Спеціалізований танцювальний центр відкриває можливості для всіх, хто бажає стати часткою цього дивовижного поєднання музики та рухів.',
                'text_ru' => 'Спортивный танец - это одно из самых удачных сочетаний спорта и искусства в современном мире. Яркие и эмоциональные действия спортсменов напитаны духом соревнований и турниров. Мир спортивных бальных танцев сегодня чрезвычайно широк и многогранен, он обретает популярность во всех странах мира. Специализированный танцевальный центр открывает возможности для всех желающих стать частью этого удивительного сочетания музыки и движений.',
                'is_show' => true
            ],
            [
                'path_image' => 'images/direction/babydance.jpg',
                'title_ua' => 'BabyDance',
                'title_ru' => 'BabyDance',
                'text_short_ua' => '',
                'text_short_ru' => '',
                'text_ua' => 'Ваш малюк з перших років життя вражає своїми здібностями та почуттям ритму? У нашому танцювальному центрі є чудова можливість розкрити талант Вашої дитини, і з ранніх років почати навчання в розважально-ігровій формі. У групах ... 3-5 років під керівництвом нашого професійного педагога на Ваших дітей чекає цілий комплекс цікавих занять: розвиток координації і ритму, розтяжка, вивчення танцювальних елементів та ігрових танців.',
                'text_ru' => 'Ваш малыш с первых лет жизни поражает своими способностями и чувством ритма? В нашем танцевальном центре есть чудесная возможность раскрыть талант Вашего ребенка, и с самых ранних лет начать обучение в развлекательно-игровой форме. В группах baby dance 3-5 лет, под руководством нашего профессионального педагога Ваших детей ожидает целый комплекс увлекательных занятий: развитие координации и ритма, растяжка, изучение танцевальных элементов и игровых танцев.',
                'is_show' => true
            ],
            [
                'path_image' => 'images/direction/cheer.jpg',
                'title_ua' => 'Чирлiдинг',
                'title_ru' => 'Чирлидинг',
                'text_short_ua' => '',
                'text_short_ru' => '',
                'text_ua' => 'Чирлідинг - це сучасний спортивно-танцювальний напрямок. Чирлідинг поєднує в собі елементи хореографії, акробатики та гімнастики. Помпони та яскраві костюми перетворюють чир-виступи у грандіозне шоу. Це видовищний, незвичайний, стильний різновид танцювального спорту.',
                'text_ru' => 'Чирлидинг - это современное спортивно-танцевальное направление. Чирлидинг сочетает в себе элементы хореографии, акробатики и гимнастики. Помпоны и яркие костюмы превращают чир-выступления в грандиозное шоу. Это зрелищный, необычный, стильный вид танцевального спорта.',
                'is_show' => true
            ],
            [
                'path_image' => 'images/direction/wedding.jpg',
                'title_ua' => '"Весiльний танець',
                'title_ru' => 'Свадебный танец',
                'text_short_ua' => '',
                'text_short_ru' => '',
                'text_ua' => 'Ваша головна подія в житті залишиться назавжди у Вашому серці та у спогадах Ваших шановних гостей. Наш танцювальний центр надає послугу постановки весільного танцю на Ваше свято. Досвідчений педагог за кілька занять поставить Вам танець Вашої мрії, з урахуванням Ваших побажань та стилістики Вашого заходу.',
                'text_ru' => 'Ваше главное событие в жизни останется навсегда в Вашем сердце и в воспоминаниях Ваших дорогих гостей. Наш танцевальный центр предоставляет услугу постановки свадебного танца на Ваше торжество. Опытный педагог за несколько занятий поставит Вам танец Вашей мечты, с учетом Ваших пожеланий и стилистики Вашего мероприятия.',
                'is_show' => true
            ],
            [
                'path_image' => 'images/direction/pro-am.jpg',
                'title_ua' => 'Pro-Am',
                'title_ru' => 'Pro-Am',
                'text_short_ua' => '',
                'text_short_ru' => '',
                'text_ua' => 'Уявімо: Ви доросла людина і вам хочеться танцювати. Тільки Ви не вмієте або вмієте не дуже добре. У Вас виникають питання: де шукати потрібного тренера, партнера? З чого почати навчання? І ось тут і розкриваються всі плюси Pro-Am: партнером шукати не потрібно, бо у його ролі виступає тренер; у парі з професіоналом навчання йде набагато швидше, ніж з партнером-любителем; Ви зможете здивувати своїх близьких і друзів яскравим і незвичайним хобі; тренер на заняттях буде займатися тільки з Вами, а індивідуальний підхід, як відомо, найефективніший в будь-якому навчанні.',
                'text_ru' => 'Представим: Вы взрослый человек и вам хочется танцевать. Только Вы не умеете или умеете не очень хорошо. У Вас возникают вопросы: где искать подходящего тренера, партнера? С чего начать обучение? И вот тут-то раскрываются все плюсы Pro-Am: партнера искать не нужно, потому что в его роли выступает тренер; в паре с профессионалом обучение идет гораздо быстрее, чем с партнером-любителем; вы сможете удивить своих близких и друзей ярким и необычным хобби; тренер на занятиях будет заниматься только с Вами, а индивидуальный подход, как известно, самый эффективный в любом обучении.',
                'is_show' => true
            ],
        ];
        DB::table('dancedirections')->insert($data);
    }
}
